Revit 2027 API
RailingHeightCorrectionOption Enumeration
 Railing height correction option.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailingHeightCorrectionOption
Public Enumeration RailingHeightCorrectionOption
public enum class RailingHeightCorrectionOption
type RailingHeightCorrectionOption
Members
Member name | Value | Description
ByType | 0 |  Railing height is determined by railing type.
Custom | 1 |  User needs to define the height value of the railing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace